Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/dsu.h
/*
 * Component description for DSU
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-28T06:54:45Z */
#ifndef _PIC32CKSG00_DSU_COMPONENT_H_
#define _PIC32CKSG00_DSU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DSU                                          */
/* ************************************************************************** */

/* -------- DSU_ADDR : (DSU Offset: 0x04) (R/W 32) Address -------- */
#define DSU_ADDR_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_ADDR) Address  Reset Value */

#define DSU_ADDR_ADDR_Pos                     _UINT32_(2)                                          /* (DSU_ADDR) Address Position */
#define DSU_ADDR_ADDR_Msk                     (_UINT32_(0x3FFFFFFF) << DSU_ADDR_ADDR_Pos)          /* (DSU_ADDR) Address Mask */
#define DSU_ADDR_ADDR(value)                  (DSU_ADDR_ADDR_Msk & (_UINT32_(value) << DSU_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the DSU_ADDR register */
#define DSU_ADDR_Msk                          _UINT32_(0xFFFFFFFC)                                 /* (DSU_ADDR) Register Mask  */

/* MBIST mode */
#define DSU_ADDR_MBIST_AMOD_Pos               _UINT32_(0)                                          /* (DSU_ADDR) Access Mode Position */
#define DSU_ADDR_MBIST_AMOD_Msk               (_UINT32_(0x3) << DSU_ADDR_MBIST_AMOD_Pos)           /* (DSU_ADDR) Access Mode Mask */
#define DSU_ADDR_MBIST_AMOD(value)            (DSU_ADDR_MBIST_AMOD_Msk & (_UINT32_(value) << DSU_ADDR_MBIST_AMOD_Pos))
#define   DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR_Val _UINT32_(0x0)                                        /* (DSU_ADDR) STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises).  */
#define   DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR_Val _UINT32_(0x1)                                        /* (DSU_ADDR) STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step.  */
#define DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR     (DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR_Val << DSU_ADDR_MBIST_AMOD_Pos) /* (DSU_ADDR) STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises). Position  */
#define DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR    (DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR_Val << DSU_ADDR_MBIST_AMOD_Pos) /* (DSU_ADDR) STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step. Position  */
#define DSU_ADDR_MBIST_Msk                    _UINT32_(0x00000003)                                  /* (DSU_ADDR_MBIST) Register Mask  */


/* -------- DSU_BCC : (DSU Offset: 0x110) (R/W 32) Boot ROM Communication Channel x -------- */
#define DSU_BCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_BCC) Boot ROM Communication Channel x  Reset Value */

#define DSU_BCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_BCC) Data Position */
#define DSU_BCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_BCC_DATA_Pos)           /* (DSU_BCC) Data Mask */
#define DSU_BCC_DATA(value)                   (DSU_BCC_DATA_Msk & (_UINT32_(value) << DSU_BCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_BCC register */
#define DSU_BCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_BCC) Register Mask  */


/* -------- DSU_CFG : (DSU Offset: 0x10) (R/W 32) Configuration -------- */
#define DSU_CFG_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_CFG) Configuration  Reset Value */

#define DSU_CFG_DCCDMALEVEL0_Pos              _UINT32_(0)                                          /* (DSU_CFG) DMA Trigger 0 Level Position */
#define DSU_CFG_DCCDMALEVEL0_Msk              (_UINT32_(0x1) << DSU_CFG_DCCDMALEVEL0_Pos)          /* (DSU_CFG) DMA Trigger 0 Level Mask */
#define DSU_CFG_DCCDMALEVEL0(value)           (DSU_CFG_DCCDMALEVEL0_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL0_Pos)) /* Assigment of value for DCCDMALEVEL0 in the DSU_CFG register */
#define   DSU_CFG_DCCDMALEVEL0_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CFG) Trigger x rises when DCC is read and falls when it is written  */
#define   DSU_CFG_DCCDMALEVEL0_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CFG) Trigger x rises when DCC is written and falls when it is read  */
#define DSU_CFG_DCCDMALEVEL0_EMPTY            (DSU_CFG_DCCDMALEVEL0_EMPTY_Val << DSU_CFG_DCCDMALEVEL0_Pos) /* (DSU_CFG) Trigger x rises when DCC is read and falls when it is written Position  */
#define DSU_CFG_DCCDMALEVEL0_FULL             (DSU_CFG_DCCDMALEVEL0_FULL_Val << DSU_CFG_DCCDMALEVEL0_Pos) /* (DSU_CFG) Trigger x rises when DCC is written and falls when it is read Position  */
#define DSU_CFG_DCCDMALEVEL1_Pos              _UINT32_(1)                                          /* (DSU_CFG) DMA Trigger 1 Level Position */
#define DSU_CFG_DCCDMALEVEL1_Msk              (_UINT32_(0x1) << DSU_CFG_DCCDMALEVEL1_Pos)          /* (DSU_CFG) DMA Trigger 1 Level Mask */
#define DSU_CFG_DCCDMALEVEL1(value)           (DSU_CFG_DCCDMALEVEL1_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL1_Pos)) /* Assigment of value for DCCDMALEVEL1 in the DSU_CFG register */
#define   DSU_CFG_DCCDMALEVEL1_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CFG) Trigger x rises when DCC is read and falls when it is written  */
#define   DSU_CFG_DCCDMALEVEL1_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CFG) Trigger x rises when DCC is written and falls when it is read  */
#define DSU_CFG_DCCDMALEVEL1_EMPTY            (DSU_CFG_DCCDMALEVEL1_EMPTY_Val << DSU_CFG_DCCDMALEVEL1_Pos) /* (DSU_CFG) Trigger x rises when DCC is read and falls when it is written Position  */
#define DSU_CFG_DCCDMALEVEL1_FULL             (DSU_CFG_DCCDMALEVEL1_FULL_Val << DSU_CFG_DCCDMALEVEL1_Pos) /* (DSU_CFG) Trigger x rises when DCC is written and falls when it is read Position  */
#define DSU_CFG_MBFI_Pos                      _UINT32_(2)                                          /* (DSU_CFG) Enables the Memory Bist Fault Injection Position */
#define DSU_CFG_MBFI_Msk                      (_UINT32_(0x1) << DSU_CFG_MBFI_Pos)                  /* (DSU_CFG) Enables the Memory Bist Fault Injection Mask */
#define DSU_CFG_MBFI(value)                   (DSU_CFG_MBFI_Msk & (_UINT32_(value) << DSU_CFG_MBFI_Pos)) /* Assigment of value for MBFI in the DSU_CFG register */
#define DSU_CFG_MISC_Pos                      _UINT32_(8)                                          /* (DSU_CFG) Device Specific Configuration Register Position */
#define DSU_CFG_MISC_Msk                      (_UINT32_(0xFFFFFF) << DSU_CFG_MISC_Pos)             /* (DSU_CFG) Device Specific Configuration Register Mask */
#define DSU_CFG_MISC(value)                   (DSU_CFG_MISC_Msk & (_UINT32_(value) << DSU_CFG_MISC_Pos)) /* Assigment of value for MISC in the DSU_CFG register */
#define DSU_CFG_Msk                           _UINT32_(0xFFFFFF07)                                 /* (DSU_CFG) Register Mask  */

#define DSU_CFG_DCCDMALEVEL_Pos               _UINT32_(0)                                          /* (DSU_CFG Position) DMA Trigger x Level */
#define DSU_CFG_DCCDMALEVEL_Msk               (_UINT32_(0x3) << DSU_CFG_DCCDMALEVEL_Pos)           /* (DSU_CFG Mask) DCCDMALEVEL */
#define DSU_CFG_DCCDMALEVEL(value)            (DSU_CFG_DCCDMALEVEL_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL_Pos)) 

