Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/dsu.h
/* -------- DSU_DCC : (DSU Offset: 0x118) (R/W 32) Debug Communication Channel x -------- */
#define DSU_DCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_DCC) Debug Communication Channel x  Reset Value */

#define DSU_DCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_DCC) Data Position */
#define DSU_DCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_DCC_DATA_Pos)           /* (DSU_DCC) Data Mask */
#define DSU_DCC_DATA(value)                   (DSU_DCC_DATA_Msk & (_UINT32_(value) << DSU_DCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_DCC register */
#define DSU_DCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DCC) Register Mask  */


/* -------- DSU_DID : (DSU Offset: 0x120) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE                    _UINT32_(0x950C053)                                  /*  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_MARKER_Pos                    _UINT32_(0)                                          /* (DSU_DID) Marker Bit Position */
#define DSU_DID_MARKER_Msk                    (_UINT32_(0x1) << DSU_DID_MARKER_Pos)                /* (DSU_DID) Marker Bit Mask */
#define DSU_DID_MARKER(value)                 (DSU_DID_MARKER_Msk & (_UINT32_(value) << DSU_DID_MARKER_Pos)) /* Assigment of value for MARKER in the DSU_DID register */
#define DSU_DID_MANID_Pos                     _UINT32_(1)                                          /* (DSU_DID) Manufacturer ID Position */
#define DSU_DID_MANID_Msk                     (_UINT32_(0x7FF) << DSU_DID_MANID_Pos)               /* (DSU_DID) Manufacturer ID Mask */
#define DSU_DID_MANID(value)                  (DSU_DID_MANID_Msk & (_UINT32_(value) << DSU_DID_MANID_Pos)) /* Assigment of value for MANID in the DSU_DID register */
#define DSU_DID_DEVSEL_Pos                    _UINT32_(12)                                         /* (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk                    (_UINT32_(0xFF) << DSU_DID_DEVSEL_Pos)               /* (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                 (DSU_DID_DEVSEL_Msk & (_UINT32_(value) << DSU_DID_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the DSU_DID register */
#define DSU_DID_PRODUCT_Pos                   _UINT32_(20)                                         /* (DSU_DID) Product Position */
#define DSU_DID_PRODUCT_Msk                   (_UINT32_(0xFF) << DSU_DID_PRODUCT_Pos)              /* (DSU_DID) Product Mask */
#define DSU_DID_PRODUCT(value)                (DSU_DID_PRODUCT_Msk & (_UINT32_(value) << DSU_DID_PRODUCT_Pos)) /* Assigment of value for PRODUCT in the DSU_DID register */
#define DSU_DID_REVISION_Pos                  _UINT32_(28)                                         /* (DSU_DID) Revision Position */
#define DSU_DID_REVISION_Msk                  (_UINT32_(0xF) << DSU_DID_REVISION_Pos)              /* (DSU_DID) Revision Mask */
#define DSU_DID_REVISION(value)               (DSU_DID_REVISION_Msk & (_UINT32_(value) << DSU_DID_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_DID register */
#define DSU_DID_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DID) Register Mask  */


/* -------- DSU_ENTRY : (DSU Offset: 0x1000) ( R/ 32) Coresight ROM Table Entry x -------- */
#define DSU_ENTRY_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_ENTRY) Coresight ROM Table Entry x  Reset Value */

#define DSU_ENTRY_EPRES_Pos                   _UINT32_(0)                                          /* (DSU_ENTRY) Entry Present Position */
#define DSU_ENTRY_EPRES_Msk                   (_UINT32_(0x1) << DSU_ENTRY_EPRES_Pos)               /* (DSU_ENTRY) Entry Present Mask */
#define DSU_ENTRY_EPRES(value)                (DSU_ENTRY_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY_EPRES_Pos)) /* Assigment of value for EPRES in the DSU_ENTRY register */
#define DSU_ENTRY_FMT_Pos                     _UINT32_(1)                                          /* (DSU_ENTRY) Format Position */
#define DSU_ENTRY_FMT_Msk                     (_UINT32_(0x1) << DSU_ENTRY_FMT_Pos)                 /* (DSU_ENTRY) Format Mask */
#define DSU_ENTRY_FMT(value)                  (DSU_ENTRY_FMT_Msk & (_UINT32_(value) << DSU_ENTRY_FMT_Pos)) /* Assigment of value for FMT in the DSU_ENTRY register */
#define DSU_ENTRY_ADDOFF_Pos                  _UINT32_(12)                                         /* (DSU_ENTRY) Address Offset Position */
#define DSU_ENTRY_ADDOFF_Msk                  (_UINT32_(0xFFFFF) << DSU_ENTRY_ADDOFF_Pos)          /* (DSU_ENTRY) Address Offset Mask */
#define DSU_ENTRY_ADDOFF(value)               (DSU_ENTRY_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY_ADDOFF_Pos)) /* Assigment of value for ADDOFF in the DSU_ENTRY register */
#define DSU_ENTRY_Msk                         _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY) Register Mask  */


/* -------- DSU_LENGTH : (DSU Offset: 0x08) (R/W 32) Length -------- */
#define DSU_LENGTH_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_LENGTH) Length  Reset Value */

#define DSU_LENGTH_LENGTH_Pos                 _UINT32_(2)                                          /* (DSU_LENGTH) Length Position */
#define DSU_LENGTH_LENGTH_Msk                 (_UINT32_(0x3FFFFFFF) << DSU_LENGTH_LENGTH_Pos)      /* (DSU_LENGTH) Length Mask */
#define DSU_LENGTH_LENGTH(value)              (DSU_LENGTH_LENGTH_Msk & (_UINT32_(value) << DSU_LENGTH_LENGTH_Pos)) /* Assigment of value for LENGTH in the DSU_LENGTH register */
#define DSU_LENGTH_Msk                        _UINT32_(0xFFFFFFFC)                                 /* (DSU_LENGTH) Register Mask  */


/* -------- DSU_MBFI0 : (DSU Offset: 0x14) (R/W 32) Memory Bist Fault Injection 0 -------- */
#define DSU_MBFI0_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_MBFI0) Memory Bist Fault Injection 0  Reset Value */

