Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/dsu.h
#define DSU_MBFI0_BIDX_Pos                    _UINT32_(0)                                          /* (DSU_MBFI0) Bit Index of injected fault Position */
#define DSU_MBFI0_BIDX_Msk                    (_UINT32_(0x1F) << DSU_MBFI0_BIDX_Pos)               /* (DSU_MBFI0) Bit Index of injected fault Mask */
#define DSU_MBFI0_BIDX(value)                 (DSU_MBFI0_BIDX_Msk & (_UINT32_(value) << DSU_MBFI0_BIDX_Pos)) /* Assigment of value for BIDX in the DSU_MBFI0 register */
#define DSU_MBFI0_AMMOD_Pos                   _UINT32_(6)                                          /* (DSU_MBFI0) Address matching mode Position */
#define DSU_MBFI0_AMMOD_Msk                   (_UINT32_(0x1) << DSU_MBFI0_AMMOD_Pos)               /* (DSU_MBFI0) Address matching mode Mask */
#define DSU_MBFI0_AMMOD(value)                (DSU_MBFI0_AMMOD_Msk & (_UINT32_(value) << DSU_MBFI0_AMMOD_Pos)) /* Assigment of value for AMMOD in the DSU_MBFI0 register */
#define   DSU_MBFI0_AMMOD_ADDR_Val            _UINT32_(0x0)                                        /* (DSU_MBFI0) Address match, fault injected when the masked master address matches with the masked bcc1.addr  */
#define   DSU_MBFI0_AMMOD_ALWAYS_Val          _UINT32_(0x1)                                        /* (DSU_MBFI0) Always matches, fault injected every AHB access  */
#define DSU_MBFI0_AMMOD_ADDR                  (DSU_MBFI0_AMMOD_ADDR_Val << DSU_MBFI0_AMMOD_Pos)    /* (DSU_MBFI0) Address match, fault injected when the masked master address matches with the masked bcc1.addr Position  */
#define DSU_MBFI0_AMMOD_ALWAYS                (DSU_MBFI0_AMMOD_ALWAYS_Val << DSU_MBFI0_AMMOD_Pos)  /* (DSU_MBFI0) Always matches, fault injected every AHB access Position  */
#define DSU_MBFI0_FTYPE_Pos                   _UINT32_(7)                                          /* (DSU_MBFI0) Fault type Position */
#define DSU_MBFI0_FTYPE_Msk                   (_UINT32_(0x1) << DSU_MBFI0_FTYPE_Pos)               /* (DSU_MBFI0) Fault type Mask */
#define DSU_MBFI0_FTYPE(value)                (DSU_MBFI0_FTYPE_Msk & (_UINT32_(value) << DSU_MBFI0_FTYPE_Pos)) /* Assigment of value for FTYPE in the DSU_MBFI0 register */
#define   DSU_MBFI0_FTYPE_STUCKAT0_Val        _UINT32_(0x0)                                        /* (DSU_MBFI0) Stuck At 0  */
#define   DSU_MBFI0_FTYPE_STUCKAT1_Val        _UINT32_(0x1)                                        /* (DSU_MBFI0) Stuck At 1  */
#define DSU_MBFI0_FTYPE_STUCKAT0              (DSU_MBFI0_FTYPE_STUCKAT0_Val << DSU_MBFI0_FTYPE_Pos) /* (DSU_MBFI0) Stuck At 0 Position  */
#define DSU_MBFI0_FTYPE_STUCKAT1              (DSU_MBFI0_FTYPE_STUCKAT1_Val << DSU_MBFI0_FTYPE_Pos) /* (DSU_MBFI0) Stuck At 1 Position  */
#define DSU_MBFI0_AMMSK_Pos                   _UINT32_(8)                                          /* (DSU_MBFI0) Address matching Mask (Word address) Position */
#define DSU_MBFI0_AMMSK_Msk                   (_UINT32_(0xFFFFFF) << DSU_MBFI0_AMMSK_Pos)          /* (DSU_MBFI0) Address matching Mask (Word address) Mask */
#define DSU_MBFI0_AMMSK(value)                (DSU_MBFI0_AMMSK_Msk & (_UINT32_(value) << DSU_MBFI0_AMMSK_Pos)) /* Assigment of value for AMMSK in the DSU_MBFI0 register */
#define DSU_MBFI0_Msk                         _UINT32_(0xFFFFFFDF)                                 /* (DSU_MBFI0) Register Mask  */


/* -------- DSU_MBFI1 : (DSU Offset: 0x18) (R/W 32) Memory Bist Fault Injection 1 -------- */
#define DSU_MBFI1_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_MBFI1) Memory Bist Fault Injection 1  Reset Value */

#define DSU_MBFI1_ADDR_Pos                    _UINT32_(2)                                          /* (DSU_MBFI1) Word Address Position */
#define DSU_MBFI1_ADDR_Msk                    (_UINT32_(0x3FFFFFFF) << DSU_MBFI1_ADDR_Pos)         /* (DSU_MBFI1) Word Address Mask */
#define DSU_MBFI1_ADDR(value)                 (DSU_MBFI1_ADDR_Msk & (_UINT32_(value) << DSU_MBFI1_ADDR_Pos)) /* Assigment of value for ADDR in the DSU_MBFI1 register */
#define DSU_MBFI1_Msk                         _UINT32_(0xFFFFFFFC)                                 /* (DSU_MBFI1) Register Mask  */


/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) ( R/ 32) Coresight ROM Table Memory Type -------- */
#define DSU_MEMTYPE_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_MEMTYPE) Coresight ROM Table Memory Type  Reset Value */

#define DSU_MEMTYPE_SMEMP_Pos                 _UINT32_(0)                                          /* (DSU_MEMTYPE) System Memory Present Position */
#define DSU_MEMTYPE_SMEMP_Msk                 (_UINT32_(0x1) << DSU_MEMTYPE_SMEMP_Pos)             /* (DSU_MEMTYPE) System Memory Present Mask */
#define DSU_MEMTYPE_SMEMP(value)              (DSU_MEMTYPE_SMEMP_Msk & (_UINT32_(value) << DSU_MEMTYPE_SMEMP_Pos)) /* Assigment of value for SMEMP in the DSU_MEMTYPE register */
#define DSU_MEMTYPE_Msk                       _UINT32_(0x00000001)                                 /* (DSU_MEMTYPE) Register Mask  */


/* -------- DSU_PID0 : (DSU Offset: 0x1FE0) ( R/ 32) Coresight ROM Table Peripheral Identification 0 -------- */
#define DSU_PID0_RESETVALUE                   _UINT32_(0xD0)                                       /*  (DSU_PID0) Coresight ROM Table Peripheral Identification 0  Reset Value */

#define DSU_PID0_PARTNBL_Pos                  _UINT32_(0)                                          /* (DSU_PID0) Part Number Low Position */
#define DSU_PID0_PARTNBL_Msk                  (_UINT32_(0xFF) << DSU_PID0_PARTNBL_Pos)             /* (DSU_PID0) Part Number Low Mask */
#define DSU_PID0_PARTNBL(value)               (DSU_PID0_PARTNBL_Msk & (_UINT32_(value) << DSU_PID0_PARTNBL_Pos)) /* Assigment of value for PARTNBL in the DSU_PID0 register */
#define DSU_PID0_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID0) Register Mask  */


/* -------- DSU_PID1 : (DSU Offset: 0x1FE4) ( R/ 32) Coresight ROM Table Peripheral Identification 1 -------- */
#define DSU_PID1_RESETVALUE                   _UINT32_(0x9C)                                       /*  (DSU_PID1) Coresight ROM Table Peripheral Identification 1  Reset Value */

#define DSU_PID1_PARTNBH_Pos                  _UINT32_(0)                                          /* (DSU_PID1) Part Number High Position */
#define DSU_PID1_PARTNBH_Msk                  (_UINT32_(0xF) << DSU_PID1_PARTNBH_Pos)              /* (DSU_PID1) Part Number High Mask */
#define DSU_PID1_PARTNBH(value)               (DSU_PID1_PARTNBH_Msk & (_UINT32_(value) << DSU_PID1_PARTNBH_Pos)) /* Assigment of value for PARTNBH in the DSU_PID1 register */
#define DSU_PID1_JEPIDCL_Pos                  _UINT32_(4)                                          /* (DSU_PID1) Low part of the JEP-106 Identity Code Position */
#define DSU_PID1_JEPIDCL_Msk                  (_UINT32_(0xF) << DSU_PID1_JEPIDCL_Pos)              /* (DSU_PID1) Low part of the JEP-106 Identity Code Mask */
#define DSU_PID1_JEPIDCL(value)               (DSU_PID1_JEPIDCL_Msk & (_UINT32_(value) << DSU_PID1_JEPIDCL_Pos)) /* Assigment of value for JEPIDCL in the DSU_PID1 register */
#define DSU_PID1_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID1) Register Mask  */


/* -------- DSU_PID2 : (DSU Offset: 0x1FE8) ( R/ 32) Coresight ROM Table Peripheral Identification 2 -------- */
#define DSU_PID2_RESETVALUE                   _UINT32_(0x2A)                                       /*  (DSU_PID2) Coresight ROM Table Peripheral Identification 2  Reset Value */

#define DSU_PID2_JEPIDCH_Pos                  _UINT32_(0)                                          /* (DSU_PID2) JEP-106 Identity Code High Position */
#define DSU_PID2_JEPIDCH_Msk                  (_UINT32_(0x7) << DSU_PID2_JEPIDCH_Pos)              /* (DSU_PID2) JEP-106 Identity Code High Mask */
#define DSU_PID2_JEPIDCH(value)               (DSU_PID2_JEPIDCH_Msk & (_UINT32_(value) << DSU_PID2_JEPIDCH_Pos)) /* Assigment of value for JEPIDCH in the DSU_PID2 register */
#define DSU_PID2_JEPU_Pos                     _UINT32_(3)                                          /* (DSU_PID2) JEP-106 Identity Code is used Position */
#define DSU_PID2_JEPU_Msk                     (_UINT32_(0x1) << DSU_PID2_JEPU_Pos)                 /* (DSU_PID2) JEP-106 Identity Code is used Mask */
#define DSU_PID2_JEPU(value)                  (DSU_PID2_JEPU_Msk & (_UINT32_(value) << DSU_PID2_JEPU_Pos)) /* Assigment of value for JEPU in the DSU_PID2 register */
#define DSU_PID2_REVISION_Pos                 _UINT32_(4)                                          /* (DSU_PID2) Revision Number Position */
#define DSU_PID2_REVISION_Msk                 (_UINT32_(0xF) << DSU_PID2_REVISION_Pos)             /* (DSU_PID2) Revision Number Mask */
#define DSU_PID2_REVISION(value)              (DSU_PID2_REVISION_Msk & (_UINT32_(value) << DSU_PID2_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_PID2 register */
#define DSU_PID2_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID2) Register Mask  */


