Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/dsu.h
/* -------- DSU_STATUSC : (DSU Offset: 0x108) ( R/ 32) Status C -------- */
#define DSU_STATUSC_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_STATUSC) Status C  Reset Value */

#define DSU_STATUSC_STATE_Pos                 _UINT32_(0)                                          /* (DSU_STATUSC) Core State Position */
#define DSU_STATUSC_STATE_Msk                 (_UINT32_(0x1F) << DSU_STATUSC_STATE_Pos)            /* (DSU_STATUSC) Core State Mask */
#define DSU_STATUSC_STATE(value)              (DSU_STATUSC_STATE_Msk & (_UINT32_(value) << DSU_STATUSC_STATE_Pos)) /* Assigment of value for STATE in the DSU_STATUSC register */
#define   DSU_STATUSC_STATE_IDLE_Val          _UINT32_(0x0)                                        /* (DSU_STATUSC) State Machine Ready  */
#define   DSU_STATUSC_STATE_MBIST_FILL_Val    _UINT32_(0x8)                                        /* (DSU_STATUSC) MBIST fill memory with zeroes  */
#define   DSU_STATUSC_STATE_MBIST_SET1_Val    _UINT32_(0x9)                                        /* (DSU_STATUSC) SET1 Phase: read '0' write '1'  */
#define   DSU_STATUSC_STATE_MBIST_SET2_Val    _UINT32_(0xA)                                        /* (DSU_STATUSC) SET2 Phase: read '1' write '0'  */
#define   DSU_STATUSC_STATE_MBIST_SET2B_Val   _UINT32_(0xB)                                        /* (DSU_STATUSC) SET2B Phase: read '0' write '1'  */
#define   DSU_STATUSC_STATE_MBIST_CLEAR1_Val  _UINT32_(0xC)                                        /* (DSU_STATUSC) CLEAR1 Phase: read '1' write '0'  */
#define   DSU_STATUSC_STATE_MBIST_CLEAR2_Val  _UINT32_(0xD)                                        /* (DSU_STATUSC) CLEAR2 Phase: read '0' write '1'  */
#define   DSU_STATUSC_STATE_MBIST_CLEAR2B_Val _UINT32_(0xE)                                        /* (DSU_STATUSC) CLEAR2B Phase: read '1' write '0'  */
#define   DSU_STATUSC_STATE_MBIST_READ_Val    _UINT32_(0xF)                                        /* (DSU_STATUSC) READ Phase: check memory is cleared  */
#define DSU_STATUSC_STATE_IDLE                (DSU_STATUSC_STATE_IDLE_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) State Machine Ready Position  */
#define DSU_STATUSC_STATE_MBIST_FILL          (DSU_STATUSC_STATE_MBIST_FILL_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) MBIST fill memory with zeroes Position  */
#define DSU_STATUSC_STATE_MBIST_SET1          (DSU_STATUSC_STATE_MBIST_SET1_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) SET1 Phase: read '0' write '1' Position  */
#define DSU_STATUSC_STATE_MBIST_SET2          (DSU_STATUSC_STATE_MBIST_SET2_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) SET2 Phase: read '1' write '0' Position  */
#define DSU_STATUSC_STATE_MBIST_SET2B         (DSU_STATUSC_STATE_MBIST_SET2B_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) SET2B Phase: read '0' write '1' Position  */
#define DSU_STATUSC_STATE_MBIST_CLEAR1        (DSU_STATUSC_STATE_MBIST_CLEAR1_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) CLEAR1 Phase: read '1' write '0' Position  */
#define DSU_STATUSC_STATE_MBIST_CLEAR2        (DSU_STATUSC_STATE_MBIST_CLEAR2_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) CLEAR2 Phase: read '0' write '1' Position  */
#define DSU_STATUSC_STATE_MBIST_CLEAR2B       (DSU_STATUSC_STATE_MBIST_CLEAR2B_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) CLEAR2B Phase: read '1' write '0' Position  */
#define DSU_STATUSC_STATE_MBIST_READ          (DSU_STATUSC_STATE_MBIST_READ_Val << DSU_STATUSC_STATE_Pos) /* (DSU_STATUSC) READ Phase: check memory is cleared Position  */
#define DSU_STATUSC_INDEX_Pos                 _UINT32_(8)                                          /* (DSU_STATUSC) MBIST, MSA, PMSA bit Index Position */
#define DSU_STATUSC_INDEX_Msk                 (_UINT32_(0x1F) << DSU_STATUSC_INDEX_Pos)            /* (DSU_STATUSC) MBIST, MSA, PMSA bit Index Mask */
#define DSU_STATUSC_INDEX(value)              (DSU_STATUSC_INDEX_Msk & (_UINT32_(value) << DSU_STATUSC_INDEX_Pos)) /* Assigment of value for INDEX in the DSU_STATUSC register */
#define DSU_STATUSC_Msk                       _UINT32_(0x00001F1F)                                 /* (DSU_STATUSC) Register Mask  */


/** \brief DSU register offsets definitions */
#define DSU_ADDR_REG_OFST              _UINT32_(0x04)      /* (DSU_ADDR) Address Offset */
#define DSU_BCC_REG_OFST               _UINT32_(0x110)     /* (DSU_BCC) Boot ROM Communication Channel x Offset */
#define DSU_BCC0_REG_OFST              _UINT32_(0x110)     /* (DSU_BCC0) Boot ROM Communication Channel x Offset */
#define DSU_BCC1_REG_OFST              _UINT32_(0x114)     /* (DSU_BCC1) Boot ROM Communication Channel x Offset */
#define DSU_CFG_REG_OFST               _UINT32_(0x10)      /* (DSU_CFG) Configuration Offset */
#define DSU_CID0_REG_OFST              _UINT32_(0x1FF0)    /* (DSU_CID0) Coresight ROM Table Component Identification 0 Offset */
#define DSU_CID1_REG_OFST              _UINT32_(0x1FF4)    /* (DSU_CID1) Coresight ROM Table Component Identification 1 Offset */
#define DSU_CID2_REG_OFST              _UINT32_(0x1FF8)    /* (DSU_CID2) Coresight ROM Table Component Identification 2 Offset */
#define DSU_CID3_REG_OFST              _UINT32_(0x1FFC)    /* (DSU_CID3) Coresight ROM Table Component Identification 3 Offset */
#define DSU_CTRL_REG_OFST              _UINT32_(0x00)      /* (DSU_CTRL) Control Offset */
#define DSU_DAL_REG_OFST               _UINT32_(0x124)     /* (DSU_DAL) Debugger Access Level Offset */
#define DSU_DATA_REG_OFST              _UINT32_(0x0C)      /* (DSU_DATA) Data Offset */
#define DSU_DCC_REG_OFST               _UINT32_(0x118)     /* (DSU_DCC) Debug Communication Channel x Offset */
#define DSU_DCC0_REG_OFST              _UINT32_(0x118)     /* (DSU_DCC0) Debug Communication Channel x Offset */
#define DSU_DCC1_REG_OFST              _UINT32_(0x11C)     /* (DSU_DCC1) Debug Communication Channel x Offset */
#define DSU_DID_REG_OFST               _UINT32_(0x120)     /* (DSU_DID) Device Identification Offset */
#define DSU_ENTRY_REG_OFST             _UINT32_(0x1000)    /* (DSU_ENTRY) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY0_REG_OFST            _UINT32_(0x1000)    /* (DSU_ENTRY0) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY1_REG_OFST            _UINT32_(0x1004)    /* (DSU_ENTRY1) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY2_REG_OFST            _UINT32_(0x1008)    /* (DSU_ENTRY2) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY3_REG_OFST            _UINT32_(0x100C)    /* (DSU_ENTRY3) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY4_REG_OFST            _UINT32_(0x1010)    /* (DSU_ENTRY4) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY5_REG_OFST            _UINT32_(0x1014)    /* (DSU_ENTRY5) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY6_REG_OFST            _UINT32_(0x1018)    /* (DSU_ENTRY6) Coresight ROM Table Entry x Offset */
#define DSU_ENTRY7_REG_OFST            _UINT32_(0x101C)    /* (DSU_ENTRY7) Coresight ROM Table Entry x Offset */
#define DSU_LENGTH_REG_OFST            _UINT32_(0x08)      /* (DSU_LENGTH) Length Offset */
#define DSU_MBFI0_REG_OFST             _UINT32_(0x14)      /* (DSU_MBFI0) Memory Bist Fault Injection 0 Offset */
#define DSU_MBFI1_REG_OFST             _UINT32_(0x18)      /* (DSU_MBFI1) Memory Bist Fault Injection 1 Offset */
#define DSU_MEMTYPE_REG_OFST           _UINT32_(0x1FCC)    /* (DSU_MEMTYPE) Coresight ROM Table Memory Type Offset */
#define DSU_PID0_REG_OFST              _UINT32_(0x1FE0)    /* (DSU_PID0) Coresight ROM Table Peripheral Identification 0 Offset */
#define DSU_PID1_REG_OFST              _UINT32_(0x1FE4)    /* (DSU_PID1) Coresight ROM Table Peripheral Identification 1 Offset */
#define DSU_PID2_REG_OFST              _UINT32_(0x1FE8)    /* (DSU_PID2) Coresight ROM Table Peripheral Identification 2 Offset */
#define DSU_PID3_REG_OFST              _UINT32_(0x1FEC)    /* (DSU_PID3) Coresight ROM Table Peripheral Identification 3 Offset */
#define DSU_PID4_REG_OFST              _UINT32_(0x1FD0)    /* (DSU_PID4) Coresight ROM Table Peripheral Identification 4 Offset */
#define DSU_PID5_REG_OFST              _UINT32_(0x1FD4)    /* (DSU_PID5) Coresight ROM Table Peripheral Identification 5 Offset */
#define DSU_PID6_REG_OFST              _UINT32_(0x1FD8)    /* (DSU_PID6) Coresight ROM Table Peripheral Identification 6 Offset */
#define DSU_PID7_REG_OFST              _UINT32_(0x1FDC)    /* (DSU_PID7) Coresight ROM Table Peripheral Identification 7 Offset */
#define DSU_STATUSA_REG_OFST           _UINT32_(0x100)     /* (DSU_STATUSA) Status A Offset */
#define DSU_STATUSB_REG_OFST           _UINT32_(0x104)     /* (DSU_STATUSB) Status B Offset */
#define DSU_STATUSC_REG_OFST           _UINT32_(0x108)     /* (DSU_STATUSC) Status C Offset */

